Repository: h53d/babylonjs-doc-cn
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: ``` javascript var myMaterial = new BABYLON.StandardMaterial("mymat", scene); myBox.material = myMaterial;&nbsp; ``` The first line creates a StandardMaterial and puts it into the variable named myMaterial.&nbsp; The second line sets the box's .material property... to be that newly-made StandardMaterial.&nbsp; The appearance of the box will not change yet, because we have not given the StandardMaterial any information about what color we want the box to be.&nbsp;
zh_cn: ``` javascript var myMaterial = new BABYLON.StandardMaterial("mymat", scene); myBox.material = myMaterial;&nbsp; ``` 第一行创建了个标准材质并把它放入一个名为myMaterial的变量.&nbsp; 第二行设置盒子的材质(.material)属性为那个新创建的标准材质.&nbsp; 孩子的外观还没有改变,因为我们还没有给该标准材质提供任何我们想要的颜色.&nbsp;

source: ```Javascript //Create a Vector3 animation at 30 FPS var animationTorus = new BABYLON.Animation("torusEasingAnimation", "position", 30, BABYLON.Animation.ANIMATIONTYPE_VECTOR3, BABYLON.Animation.ANIMATIONLOOPMODE_CYCLE);
zh_cn: ```Javascript //创建一个3维空间里的30帧每秒的动画 var animationTorus = new BABYLON.Animation("torusEasingAnimation", "position", 30, BABYLON.Animation.ANIMATIONTYPE_VECTOR3, BABYLON.Animation.ANIMATIONLOOPMODE_CYCLE);

source: ```Javascript BABYLON.Animation.CreateAndStartAnimation('boxscale', box1, 'scaling.x', 30, 120, 1.0, 1.5); ``` Fast and easy.
zh_cn: ```Javascript BABYLON.Animation.CreateAndStartAnimation('boxscale', box1, 'scaling.x', 30, 120, 1.0, 1.5); ``` 快速而简便.

source: ```javascript // An array with all animation keys var keys = [];
zh_cn: ```javascript // 存储所有动画键值的数组 var keys = [];

source: ```javascript animationBox.setKeys(keys); ``` * Link this animation to our box:
zh_cn: ```javascript animationBox.setKeys(keys); ``` * 将动画和对象链接起来

source: in our Basic Elements tutorial.&nbsp; For now, I just wanted to show you that it does not use a .diffuseColor property like a box with a StandardMaterial applied, nor a .diffuse property like we used for coloring light beams.&nbsp; It, instead, uses a property called .color.&nbsp; Simple.
zh_cn: 在我们的基础元素教程里.&nbsp; 至于现在, 我只是想表示它(线对象)不像盒子那样应用标准材质并对其(材质)使用.diffuseColor属性来设置颜色, 也不想光线那样使用.diffuse属性来设置颜色.&nbsp; 相反,我们直接使用一个.color属性.&nbsp; 就是这样简单.

source: return FunnyEase; })(BABYLON.EasingFunction); ``` You will find a complete demonstration of the easing functions behaviors, in the playground : [**Easing function playground**](http://babylonjs-playground.azurewebsites.net/?20)
zh_cn: return FunnyEase; })(BABYLON.EasingFunction); ``` 在娱乐展示里, 你会找到一个简化函数行为的完整演示: [**简化函数娱乐展示**](http://babylonjs-playground.azurewebsites.net/?20)

source: | Name | Type | Description ---|---|---|---
zh_cn: | 名称 | 类型 | 描述 ---|---|---|---

source: | from | number | The fps starting frame
zh_cn: | 起始| 数 | 开始fps

source: | target | any | The target
zh_cn: | 目标 | 任意 | 特定目标

source: | to | number | The fps ending frame optional | loop | boolean | If true, the animation will loop (dependent upon BABYLON.Animation.ANIMATIONLOOPMODE) optional | speedRatio | number | default : 1.
zh_cn: | 止于 | 数量 | 结束fps 可选 | 循环 | 布尔值 | 如果为真,则动画循环播放 (取决于BABYLON.Animation.ANIMATIONLOOPMODE) 可选 | 速率 | 数值 | 默认 : 1.
